app/Controllers/Usuario_Controller.php

	public function formValidation(){
		$input = $this->validate([
			'nombre' => 'required|min_length[3]',
			'apellido' => 'required|min_length[3]|max_length[25]',
			'usuario'=> 'required|min_length[3]',
			'email'    => 'required|min_length[4]|max_length[100]|valid_email|is_unique[usuarios.email]',
			'pass'=> 'required|min_length[3]|max_length[10]',
		],
        );

		$formModel = new Usuarios_model();
		if(!$input){
			$data['titulo']='Registro';
			echo view ('front/head_view', $data);
			echo view ('front/nav_view');
			echo view ('front/registro', ['validation' => $this->validator]);
			echo view ('front/footer_view');

		} else {
			$formModel->save([
				'nombre' => $this->request->getVar('nombre'),
				'apellido' => $this->request->getVar('apellido'),
				'usuario' => $this->request->getVar('usuario'),
				'email' => $this->request->getVar('email'),
				'pass' => password_hash($this->request->getVar('pass'), PASSWORD_DEFAULT)
			]);
---
INSERT INTO `usuarios` (`nombre`, `apellido`, `usuario`, `email`, `pass`) VALUES ('Jose', 'Gomez', 'Jose123', 'jose123@gmail.com', '$2y$10$/P17rK/ibJfcyn4EL6bY9.2A.Q3Tvh9PmPwrhw/3WWROokQt/5uee')